/* -------------------------------------------------------------------------- */
/* Enums */
/* -------------------------------------------------------------------------- */

/* TINTodoStatus */

"OLNMOe" = "Estado"; /* Display Name */

"mQr54o" = "desconocido";   /* Value: unknown */
"8K78Gu" = "Abierta";      /* Value: open */
"HSjTOt" = "Finalizada"; /* Value: completed */
"1Ncljt" = "Cancelada";  /* Value: canceled */

/* -------------------------------------------------------------------------- */
/* Types */
/* -------------------------------------------------------------------------- */

/* TINTodo */

"OMXxQN" = "Tarea de Things"; /* Display Name */

"q1gqw8" = "UUID";      /* Property: uuid */
"LiLlEf" = "Título";     /* Property: title */
"Kw5NWX" = "Lista";      /* Property: list */
"R3fuSz" = "Cuándo";      /* Property: when */
"8TjwzE" = "De noche";   /* Property: evening */
"gRh7no" = "No";        /* Property: evening (false value) */
"WHB5qC" = "Sí";       /* Property: evening (true value) */
"bww4JS" = "Recordatorio";  /* Property: reminder */
"19lPBk" = "Vencimiento";  /* Property: deadline */
"pp3qBd" = "Notas";     /* Property: notes */
"UDIc1x" = "Lista de comprobación"; /* Property: checklist */
"KQzIKq" = "Etiquetas";      /* Property: tags */

/* TINList */

"x7Empa" = "Lista de Things"; /* Display Name */

/* -------------------------------------------------------------------------- */
/* Intents */
/* -------------------------------------------------------------------------- */

/* TINAddTodo */

"jUtU4g" = "Añadir tarea"; /* Title */
"1Xn7Aa" = "Añade una nueva tarea a Things."; /* Description */

"YmSQDf" = "Tarea"; /* Parameter: title */
"LHHz9E" = "¿Cuál es el título?"; /* Parameter: title, dialog (Primary) */

"ZlzpNK" = "Lista"; /* Parameter: list */
"X4r1DR" = "¿A qué lista desea añadirla?"; /* Parameter: list, dialog (DisambiguationSelection) */

"unnTAD" = "Cuándo"; /* Parameter: when */
"VkNe0C" = "¿Cuándo desea empezar?"; /* Parameter: when, dialog (Primary) */

"gaX3hF" = "De noche"; /* Parameter: evening */
"b10WOZ" = "¿De noche?"; /* Parameter: evening, dialog (Primary) */
"0fPzah" = "No"; /* Parameter: evening (false value) */
"KWUIrj" = "Sí"; /* Parameter: evening (true value) */

"AeXgbS" = "Hora del recordatorio"; /* Parameter: reminderTime */
"3Nk1Yl" = "¿A qué hora desea recibir el recordatorio?"; /* Intent TINAddTodo -> Parameter: reminderTime, dialog (Primary) */

"BzuFhi" = "Vencimiento"; /* Parameter: deadline */
"xi8sPe" = "¿Cuándo vence?"; /* Parameter: deadline, dialog (Primary) */

"NYFM84" = "Etiquetas"; /* Parameter: tags */
"l0xizU" = "¿Qué etiquetas se deben añadir?"; /* Parameter: tags, dialog (Primary) */

"tfx4bF" = "Estado"; /* Parameter: status */
"sS5Ms4" = "¿Cuál es el estado?"; /* Parameter: status, dialog (DisambiguationSelection) */

"DZdOjf" = "Editar en Things"; /* Parameter: editInThings */
"W5N6Yo" = "¿Desea abrir Things para editar esta tarea?"; /* Parameter: editInThings, dialog (Primary) */
"bRVelp" = "No"; /* Parameter: editInThings (false value) */
"ZSGv41" = "Sí"; /* Parameter: editInThings (true value) */

"o8AABR" = "Notas"; /* Parameter: notes */
"pjyLst" = "¿Qué notas desea añadir?"; /* Parameter: notes, dialog (Primary) */

"uHRvWn" = "Lista de comprobación"; /* Parameter: checklist */
"VIitBC" = "¿Qué elementos desea añadir a la lista de comprobación?"; /* Parameter: checklist, dialog (Primary) */

"6nhwMl" = "${todoTitle} se ha añadido."; /* Response Code: success (voice-only dialog) */
"NKVz1k" = "${todoTitle} se ha añadido."; /* Response Code: success (printed dialog) */
"sr1IRz" = "Ha habido un error al añadir la tarea."; /* Response Code: failure (voice-only dialog) */
"LyHwKB" = "Ha habido un error al añadir la tarea."; /* Response Code: failure (printed dialog) */
"j6LE7B" = "La tarea se ha añadido."; /* Response Code: successEmptyTitle (voice-only dialog) */
"rNH42i" = "La tarea se ha añadido."; /* Response Code: successEmptyTitle (printed dialog) */

"Lj80pA" = "Título de la tarea"; /* Response Parameter: todoTitle */
"Br1Zm3" = "Tarea"; /* Response Parameter: todo */

"9LylOv" = "Añadir ${title}"; /* Shortcuts App: title,list,status,when,deadline,notes,checklist,tags,editInThings (title) */
"wBHz6x" = "Añadir ${title}"; /* Shortcuts App: title,notes,checklist,when,deadline,tags,list,status,editInThings,reminderTime,evening (title) */

/* TINShowTodo */

"jANQXX" = "Mostrar tarea"; /* Title */
"JdIZ8x" = "Muestra la tarea especificada en Things."; /* Description */

"WAIq5F" = "Tarea"; /* Parameter: todo */

"YIbDyi" = "Mostrar ${todo}"; /* Shortcuts App: todo (title) */

/* TINShowList */

"ptz6wF" = "Mostrar lista"; /* Title */
"xo5PDm" = "Muestra la lista especificada en Things."; /* Description */

"RW2Nyz" = "Lista"; /* Parameter: list */
"V1nlDA" = "¿Qué lista?"; /* Parameter: list, dialog (DisambiguationSelection) */

"3hu2WN" = "Filtrar por etiquetas"; /* Parameter: filterByTags */
"HQ0TAS" = "¿Qué etiquetas?"; /* Parameter: filterByTags, dialog (DisambiguationSelection) */

"vKhBKF" = "Mostrar ${list}"; /* Shortcuts App: list,filterByTags (title) */
"poYHAf" = "Mostrar ${list}"; /* Shortcuts App: list (title) */

"mlANgr" = "Mostrar ${list}"; /* Suggestions: list (title) */

/* TINRunThingsURL */

"lW66Em" = "Ejecutar URL de Things"; /*  Title */
"keYeZ9" = "Ejecuta una URL de Things en segundo plano."; /*  Description */

"uPeA3l" = "URL de Things"; /*  Parameter: url */
"oTrE0f" = "¿Cuál es la URL?"; /* Intent TINRunThingsURL -> Parameter: url, dialog (Primary) */

"Xq4kUL" = "La URL se ha ejecutado correctamente."; /*  Response Code: success (voice-only dialog) */
"DDKH5R" = "La URL se ha ejecutado correctamente."; /*  Response Code: success (printed dialog) */
"a4aEdR" = "Ha habido un error al ejecutar la URL."; /*  Response Code: failure (voice-only dialog) */
"LNTEqX" = "Ha habido un error al ejecutar la URL."; /*  Response Code: failure (printed dialog) */

"uth0Px" = "Ejecutar URL de Things ${url}"; /*  Shortcuts App: url (title) */

/* INAddTasks (customized system intent) */

"3s4Pq7" = "Añadir tareas"; /* Title */
"J4CdGj" = "Usa la funcionalidad integrada para añadir tareas a Things. Solo permite usar ciertos parámetros."; /* Intent AddTasks -> Description */

"IF3OZi" = "Lista de tareas"; /* Parameter: targetTaskList */
"uNB8yE" = "Títulos"; /* Parameter: taskTitles */
"2x4fQs" = "Spatial Event Trigger"; /* Parameter: spatialEventTrigger */
"itSKVK" = "Temporal Event Trigger"; /* Parameter: temporalEventTrigger */

"sLae48" = "Abrir Things"; /* Suggestions:  (title) */
